brew "git"
brew "neovim"
brew "starship"
brew "jq"

brew "fzf"           # Fuzzy finder
brew "zoxide"        # Smarter cd
brew "eza"           # Modern ls
brew "bat"           # Better cat
brew "git-delta"     # Better git diffs
brew "lazygit"       # Git TUI
brew "ripgrep"       # Fast grep
brew "fd"            # Fast find
brew "just"          # Command runner

# Language / version managers
brew "uv"            # Python package/project manager (owns .venv)
brew "ruff"          # Python linter/formatter
brew "mise"          # Tool version manager — owns Node + Go + Python
brew "pnpm"          # Default Node package manager

# Go toolchain (the Go runtime comes from mise; these are standalone CLI tools
# that pick up mise's go on PATH — keeps one source of truth for the Go version)
brew "golangci-lint" # Standard Go meta-linter
brew "delve"         # Go debugger (dlv)

brew "awscli"
brew "gh"            # GitHub CLI (PRs, auth, releases)
brew "caddy"         # Reverse proxy for local *.lvh.me vanity URLs — see caddy/Caddyfile

brew "antidote"

# Quality-of-life CLI
brew "sd"            # Intuitive sed alternative
brew "dust"          # du replacement
brew "btop"          # System monitor
brew "tlrc"          # tldr client (concise man pages)

# Apps
cask "ghostty"                 # GPU terminal (daily driver)
cask "visual-studio-code"      # Primary editor

# Fonts
cask "font-hack-nerd-font"
