brew "git"
brew "neovim"
brew "starship"
brew "jq"

brew "fzf"           # Fuzzy finder
brew "zoxide"        # Smarter cd
brew "eza"           # Modern ls
brew "bat"           # Better cat
brew "git-delta"     # Better git diffs
brew "lazygit"       # Git TUI
brew "ripgrep"       # Fast grep
brew "fd"            # Fast find

brew "fnm"           # Node Manager
brew "uv"            # Python package/project manager
brew "ruff"          # Python linter/formatter

brew "gnupg"
brew "pinentry-mac"

brew "awscli"

brew "antidote"

cask "font-hack-nerd-font"
